import 'class.dart';

class Data {
  static List<Countries> countries = [
    Countries(id: '1', name: 'غذاهای افغانی', flag: 'assets/afg.jpeg'),
    Countries(id: '2', name: 'غذاهای ایرانی', flag: 'assets/ir.jpg'),
    Countries(id: '3', name: 'غذاهای هندی', flag: 'assets/ind.png'),
    Countries(id: '4', name: 'غذاهای ترکی', flag: 'assets/tur.gif'),
  ];

  static List<Recipe> afghani = [
    Recipe(
        id: '1', name: 'قابلی',
        image: 'assets/qabuli.png',
        steps: [
      ' برنج به مقدار لازم را داخل',
      ' دیگ ریخته و آب اضافه می کنیم',
      'گوشت گوسفند را تفت داده بعدا ادویه',
      ' های ضروری را اضافه میکنیم',
      'کشمش به مقدار لازم را همراه با',
      ' جلال های زردک سرخ میکنیم',
      'در آخر همه را با هم یکجا نموده ',
      'و نوش جان میکنیم '
    ],
        ingredients: [
      'برنج',
      'گوشت',
      'روغن',
      'کشمش',
      'زردک زرد',
    ]),
    Recipe(
        id: '2',
        name: 'کیچیری',
        image: 'assets/kechiri.jpeg',
        steps: ['مرحله اول', 'مرحله دوم', 'مرحله سوم', 'مرحله آخر'],
        ingredients: ['ترکیبات آزمایشی اول', 'ترکیاب آزمایشی دوم']),
    Recipe(
        id: '3',
        name: 'منتو',
        image: 'assets/manto.jpg',
        steps: ['مرحله اول', 'مرحله دوم', 'مرحله سوم', 'مرحله آخر'],
        ingredients: ['ترکیبات آزمایشی اول', 'ترکیاب آزمایشی دوم']),
    Recipe(
        id: '4',
        name: 'آشک',
        image: 'assets/ashak.jpg',
        steps: ['مرحله اول', 'مرحله دوم', 'مرحله سوم', 'مرحله آخر'],
        ingredients: ['ترکیبات آزمایشی اول', 'ترکیاب آزمایشی دوم']),
  ];

  static List<Recipe> irani = [
    Recipe(
        id: '5',
        name: 'حلیم',
        image: 'assets/halim.jpg',
        steps: ['مرحله اول', 'مرحله دوم', 'مرحله سوم', 'مرحله آخر'],
        ingredients: ['ترکیبات آزمایشی اول', 'ترکیاب آزمایشی دوم']),
    Recipe(
        id: '6',
        name: 'جوجه',
        image: 'assets/joje.jpeg',
        steps: ['مرحله اول', 'مرحله دوم', 'مرحله سوم', 'مرحله آخر'],
        ingredients: ['ترکیبات آزمایشی اول', 'ترکیاب آزمایشی دوم']),
    Recipe(
        id: '7',
        name: 'قورمه سبزی',
        image: 'assets/qormeSabzi.jpg',
        steps: ['مرحله اول', 'مرحله دوم', 'مرحله سوم', 'مرحله آخر'],
        ingredients: ['ترکیبات آزمایشی اول', 'ترکیاب آزمایشی دوم']),
    Recipe(
        id: '8',
        name: 'کشک بادمجون',
        image: 'assets/kashk.jpeg',
        steps: ['مرحله اول', 'مرحله دوم', 'مرحله سوم', 'مرحله آخر'],
        ingredients: ['ترکیبات آزمایشی اول', 'ترکیاب آزمایشی دوم']),
  ];

  static List<Recipe> hindi = [
    Recipe(
        id: '9',
        name: 'بریانی',
        image: 'assets/baryani.jpeg',
        steps: ['مرحله اول', 'مرحله دوم', 'مرحله سوم', 'مرحله آخر'],
        ingredients: ['ترکیبات آزمایشی اول', 'ترکیاب آزمایشی دوم']),
    Recipe(id: '10', name: 'کرایی', image: 'assets/karaie2.jpeg', steps: [
      'مرحله اول',
      'مرحله دوم',
      'مرحله سوم',
      'مرحله آخر'
    ], ingredients: [
      'روغن زیتون: ۳ قاشق غذاخوری',
      'پیاز ریز خرد شده: ۱ عدد',
      'فلفل دلمه: نصف یک عدد',
      'زنجبیل رنده شده: ۵ قاشق غذاخوری',
      'سیر خرد شده: ۲ قاشق غذاخوری',
      'ران مرغ بدون پوست و بدون استخوان: ۴ عدد',
      'گوجه فرنگی خرد شده: ۱/۵ لیوان',
      'زیره آسیاب شده: ۱ قاشق چایخوری',
      'تخم گشنیز آسیاب شده: ۱ قاشق چایخوری',
      'ادویه گرام ماسالا: ۱ قاشق چایخوری',
      'پودر چیلی قرمز: ۱ قاشق غذاخوری',
      'پودر زردچوبه: نصف قاشق مرباخوری',
      'نمک: به مقدار لازم',
      'گشنیز خرد شده: ۱/۴ لیوان ',
    ]),
    Recipe(
        id: '11',
        name: 'دال',
        image: 'assets/dal.jpeg',
        steps: ['مرحله اول', 'مرحله دوم', 'مرحله سوم', 'مرحله آخر'],
        ingredients: ['ترکیبات آزمایشی اول', 'ترکیاب آزمایشی دوم']),
    Recipe(
        id: '12',
        name: 'پانی پوری',
        image: 'assets/panipuri.jpg',
        steps: ['مرحله اول', 'مرحله دوم', 'مرحله سوم', 'مرحله آخر'],
        ingredients: ['ترکیبات آزمایشی اول', 'ترکیاب آزمایشی دوم']),
  ];

  static List<Recipe> turkey = [
    Recipe(
        id: '13',
        name: 'دونر کباب',
        image: 'assets/doner.jpg',
        steps: ['مرحله اول', 'مرحله دوم', 'مرحله سوم', 'مرحله آخر'],
        ingredients: ['ترکیبات آزمایشی اول', 'ترکیاب آزمایشی دوم']),
    Recipe(
        id: '14',
        name: 'لاهماجون',
        image: 'assets/lahmajon.jpeg',
        steps: ['مرحله اول', 'مرحله دوم', 'مرحله سوم', 'مرحله آخر'],
        ingredients: ['ترکیبات آزمایشی اول', 'ترکیاب آزمایشی دوم']),
    Recipe(
        id: '15',
        name: 'دلمه',
        image: 'assets/dolme.jpg',
        steps: ['مرحله اول', 'مرحله دوم', 'مرحله سوم', 'مرحله آخر'],
        ingredients: ['ترکیبات آزمایشی اول', 'ترکیاب آزمایشی دوم']),
    Recipe(
        id: '16',
        name: 'بورک',
        image: 'assets/borak.jpeg',
        steps: ['مرحله اول', 'مرحله دوم', 'مرحله سوم', 'مرحله آخر'],
        ingredients: ['ترکیبات آزمایشی اول', 'ترکیاب آزمایشی دوم']),
  ];
}
